<a href="https://colab.research.google.com/github/AANG-804/2021-8-PNU-AI-/blob/main/AI_%EC%95%84%EC%B9%B4%EB%8D%B0%EB%AF%B8_2021%EB%85%84_8%EC%9B%94_11%EC%9D%BC_Review.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# AI 아카데미 2021년 8월 11일 Review

## Pandas

In [2]:
import pandas as pd

In [5]:
# 인덱스 추가하여 Series 객체 생성하기
# Series 만들 때 S 대문자 조심
year = ['2019', '2020', '2021', '2022']
idx = ['a', 'b', 'c', 'd']

result = pd.Series(data=year, index=idx, name="year")
result

a    2019
b    2020
c    2021
d    2022
Name: year, dtype: object

In [7]:
# 딕셔너리로 Series 만들기

score = {'Kim':85, 'Han':89, 'Lee':99, 'Choi':70}

score_series = pd.Series(score, name="score")
score_series

Kim     85
Han     89
Lee     99
Choi    70
Name: score, dtype: int64

In [14]:
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}

i = ['a', 'b', 'c', 'd']
c = ['score', 'grade', 'name', 'email']

# D랑 F 대문자 조심, column's' s붙이는거 잊지 않기
df = pd.DataFrame(data = score, index=i,columns=c )
df

   score grade   name email
a    100     A  Jessi   NaN
b     95     A   Emma   NaN
c     80     B   Alex   NaN
d     85     B    Tom   NaN

In [15]:
# df.info() 데이터분석에 있어서 중요한 함수
df.info()
# index의 개수, column의 개수, column의 값들이 잘 들어가있는지 확인

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   score   4 non-null      int64
 1   grade   4 non-null      object
 2   name    4 non-null      object
 3   email   0 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [16]:
# df.head(n), df.tail(n) 데이터프레임의 가장 위 또는 아래에서 몇개의 데이터를 가져옴

df.head(2)
# 큰 크기의 데이터프레임의 모양을 파악하기에 좋음

   score grade   name email
a    100     A  Jessi   NaN
b     95     A   Emma   NaN

In [19]:
# df.sample(n or frac=0~1, random_state=n)
# n = 뽑을 샘플의 개수, frac = 0~1 의 비율만큼 표본을 추출, random_state = 랜덤경우를 통제
print(df.sample(2, random_state=1))
print(df.sample(frac=0.8, random_state=3))

   score grade  name email
d     85     B   Tom   NaN
c     80     B  Alex   NaN
   score grade   name email
d     85     B    Tom   NaN
b     95     A   Emma   NaN
a    100     A  Jessi   NaN

In [20]:
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'age': [20, 24, 23, 20, 27],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
score_df

    name  age  score grade subject
0  Jessi   20    100     A  python
1   Emma   24     95     A    java
2   Alex   23     80     B  python
3  Jessi   20     85     B       c
4    Tom   27     97     A    java

In [21]:
# include가 생략될경우 default는 수치데이터에 대한 기술통계값들을 출력함
print(score_df.describe())

             age       score
count   5.000000    5.000000
mean   22.800000   91.400000
std     2.949576    8.502941
min    20.000000   80.000000
25%    20.000000   85.000000
50%    23.000000   95.000000
75%    24.000000   97.000000
max    27.000000  100.000000

In [23]:
# 인덱싱을 통해 번주형 데이터들에 대한 통계도 표시할 수 있음
# 인덱싱 할 때 대괄호 개수 조심할 것
score_df[['grade', 'subject']].describe()

       grade subject
count      5       5
unique     2       3
top        A    java
freq       3       2

In [24]:
print(score_df.describe(include = 'all'))

         name        age       score grade subject
count       5   5.000000    5.000000     5       5
unique      4        NaN         NaN     2       3
top     Jessi        NaN         NaN     A    java
freq        2        NaN         NaN     3       2
mean      NaN  22.800000   91.400000   NaN     NaN
std       NaN   2.949576    8.502941   NaN     NaN
min       NaN  20.000000   80.000000   NaN     NaN
25%       NaN  20.000000   85.000000   NaN     NaN
50%       NaN  23.000000   95.000000   NaN     NaN
75%       NaN  24.000000   97.000000   NaN     NaN
max       NaN  27.000000  100.000000   NaN     NaN

In [25]:
score_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   age      5 non-null      int64
 2   score    5 non-null      int64
 3   grade    5 non-null      object
 4   subject  5 non-null      object
dtypes: int64(2), object(3)
memory usage: 328.0+ bytes

In [26]:
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
df

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [36]:
# 행데이터를 조회할 때는 .loc 함수가 필요함
# loc를 잊지 말자 loc가 중요하다
df.loc[2:3]

row_idx = [1,2,4]
col_idx = ['name', 'subject', 'grade']
print(df.loc[row_idx,col_idx])

   name subject grade
1  Emma    java     A
2  Alex  python     B
4   Tom    java     A

In [40]:
# Series 객체 생성하여 'semester' 라는 열 추가
semester_data = pd.Series(['20-01', '20-01', '20-02', '20-01'])
df['semester'] = semester_data
df

# 조건을 통해 bool 으로 이루어진 시리즈를 만들 수 있음
df['did_pass'] = df['score'] > 90
df

    name subject  score grade  etc semester  did_pass
0  Jessi  python    100     A  NaN    20-01      True
1   Emma    java     95     A  NaN    20-01      True
2   Alex  python     80     B  NaN    20-02     False
3  Jessi       c     85     B  NaN    20-01     False
4    Tom    java     97     A  NaN      NaN      True

In [42]:
df.loc[2]["etc"] = "baboo"
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    name subject  score grade  etc semester  did_pass
0  Jessi  python    100     A  NaN    20-01      True
1   Emma    java     95     A  NaN    20-01      True
2   Alex  python     80     B  NaN    20-02     False
3  Jessi       c     85     B  NaN    20-01     False
4    Tom    java     97     A  NaN      NaN      True

In [44]:
# 1) drop() 이용하여 행 데이터 삭제
# 삭제된 상태의 객체를 반환할 뿐, 원본 데이터는 삭제하지 않음
# 삭제된 상태의 객체를 새로운 변수에 저장하여 사용할 것
# 2) inplace 인자를 사용하여 원본 데이터에 바로 삭제
# new_obj = df.drop(index, inplace=True)

df_delete = df.drop(index=2, columns='grade')
print(df_delete)
print(df)

    name subject  score  etc semester  did_pass
0  Jessi  python    100  NaN    20-01      True
1   Emma    java     95  NaN    20-01      True
3  Jessi       c     85  NaN    20-01     False
4    Tom    java     97  NaN      NaN      True
    name subject  score grade  etc semester  did_pass
0  Jessi  python    100     A  NaN    20-01      True
1   Emma    java     95     A  NaN    20-01      True
2   Alex  python     80     B  NaN    20-02     False
3  Jessi       c     85     B  NaN    20-01     False
4    Tom    java     97     A  NaN      NaN      True